package com.app5_연산자;

import java.util.Arrays;

public class OPTest {

	public static void main(String[] args) {
		/*
		 * 
		 * 	1. 산술 연산자
		 * 
		 * 		+ : 더하기
		 * 		- : 빼기
		 * 		* : 곱하기
		 * 		/ : 나누기(몫)
		 * 		% : 나누기(나머지)
		 * 
		 * 	2. 대입 연산자
		 * 
		 * 		a=b; // a값을 b에 대입
		 * 		a+=b; // a값과 b값을 더해서 a에 대입 , a = a+b; 동일
		 * 		a-=b; // a값에서 b값을 빼서 a에 대입 , a = a-b;
		 * 		a*=b; // a값과 b값을 곱해서 a에 대입, a = a*b;
		 * 		a/=b; // a = a/b;
		 * 		a%=b; // a = a%b;
		 * 
		 * 	3. 비교 연산자 ==> 실행결과는 논리값(true/false)
		 * 
		 * 		a == b; //a와 b가 같냐
		 * 		a > b; // a가 b보다 크냐
		 * 		a >= b; // a가 b보다 크거나 같냐
		 * 		a != b; // a랑 b가 같지 않냐
		 * 
		 * 	4. 증감 연산자(증가 연산자, 감소연산자)
		 * 
		 * 		가. 증가 연산자(1씩 증가)
		 * 			++변수명; //전치, 변수명 = 변수명 + 1; 변수명+=1;
		 * 
		 * 		나. 감소 연산자(1씩 감소)
		 * 			--변수명;
		 * 			변수명--;
		 * 
		 * 	5. 논리 연산자 ==> 논리값 이용(true, false)
		 * 
		 * 		가. && (AND 해석)
		 * 
		 * 
		 * 		나. || (OR 해석)
		 * 
		 * 		다. ! (NOT 해석)
		 * 
		 *  6. 3항 연산자
		 *  
		 *  	변수명 = (조건식)?참:거짓;
		 *  
		 *  7. instanceof 연산자
		 *  
		 *  	==> 참조형에서 변수의 데이터형 비교할 때 사용
		 */

	}

}
