package com.app1_인터페이스;

public class TestMain {

	public static void main(String[] args) {

		/*
		 * 	인터페이스(interface)
		 * 
		 * 	1. 문법:
		 * 		public interface 인터페이스명{  }
		 * 
		 * 
		 * 	2. 구성요소
		 * 		- 상수
		 * 		- 추상메서드
		 * 		- default 메서드
		 * 		- static 메서드
		 * 
		 * 	3. 특징
		 * 		- 객체 생성 불가(new 불가)
		 * 		 => 따라서 다른클래스의 도움을 받아서 인터페이스의 요소를 사용할 수 있다.
		 * 			인터페이스와 다른클래스의 관계는 구현관계(준상속관계)이다.
		 * 			=> 인터페이스를 사용하기 위해서는 구현을 사용해야 한다.
		 * 			=> 구현은 UML로는 삼각형의 점선
		 * 		- 다형성 적용 가능
		 * 
		 * 	4. 목적 2가지
		 * 
		 * 		가. 하위 클래스에서 특정 메서드 강제(*****)
		 * 		나. 클래스간의 의존성 감소(*****)
		 * 
		 * 
		 * 
		 * 
		 */

	}

}
