package com.app1_OOP;

public class OOP개념 {
	public static void main(String[] args) {
		/*
		 * 
		 * 	자바 프로그램 언어 특징
		 * 
		 * 	1. 객체지향 프로그래밍 언어(Object Oriented Programming)
		 * 	2. JVM(Java Virtual Machine)기반으로 동작하기 때문에 플랫폼에 독립적이다.
		 * 
		 * 		class(바이트코드)
		 * 	------------
		 * 		JVM // JVM이 있기에 os에 독립적이다.(JVM에는 의존적이다. 바이트코드)
		 * 	------------
		 * 		os (window, linux)
		 * 	------------
		 *  	hw
		 *  3. 자동으로 메모리 관리
		 *  	==> heap 메모리에 생성된 인스턴스를 자동으로 제거해준다.
		 *  	==> Garbage Collection (G.C)처리
		 *  
		 */
		
		/*
		 * 
		 *  1. 객체지향 프로그래밍 언어(Object Oriented Programming)
		 *  	==> 객체를 지향(활용)해서 프로그래밍하는 개발 방법론 의미
		 *  
		 *  2. 객체(object)?
		 *  	==>현재 자신(주체)가 눈으로 보는 사물의미.
		 *  	ex. 노트북, 책상, 마이크 ,....
		 *  	
		 *  
		 *  	==> 객체는 2가지 구성요소
		 *  		ex. 노트북 객체
		 *  	
		 *  		가. 속성 : 색상, 가격, 크기
		 *  		나. 동작 : on,off
		 *  
		 *  	주체(subject) -------------------------->사물(객체)
		 *  	자신
		 *  	
		 *  	프로젝트 프로세스
		 *  
		 *  	분석 -------> 설계 -------> 구현 -------> 테스트 ------->배포
		 * 		객체추출 ----> 클래스
		 * 
		 * 		ex. 학생관리 프로그램
		 * 			 (현실세계)                         (가상세계)    new      (메모리에 로딩)
		 * 			- 학생객체 ==========================> 클래스 ============> 인스턴스(객체),인스턴스
		 * 				속성: 학번, 이름, 나이, 전화번호,...==>변수   =============> 인스턴스 변수
		 * 				동작: 공부하기,...================>메서드  =============> 인스턴스 메서드 
		 * 
		 * 			- 교수객체
		 * 			- 강좌객체
		 * 
		 * 		* 클래스는 틀(설계도) 역할을 담당한다.
		 * 
		 */
	}
}
